{
  "title": "How to set Ringtone in Moto G5 Plus",
  "date": "2018-02-21T00:00:00.000Z",
  "dateModified": "2020-06-19T00:00:00.000Z",
  "author": "Rishit Patel",
  "description": "Some people find difficulties in customizing their Moto G5 Plus. Here is a step-by-step guide on how to set a ringtone in Moto G5 Plus.",
  "tags": [
    "Smartphones",
    "How to",
    "Tricks"
  ],
  "featureImage": "Set-Ringtonein-moto-g5-plus-1.png",
  "content": [
    {
      "type": "paragraph",
      "content": "Moto G5 Plus is one of the best-selling smartphones in India. It is a great value phone in the limited budget segment. Some people find difficulties in customizing their Moto G5 Plus according to their preferences. Setting a custom ringtone is a part of customizing your smartphone. Today we are going to share with you a step-by-step guide on how to set a ringtone in Moto G5 Plus."
    },
    {
      "type": "heading",
      "content": "How to set Ringtone in Moto G5 Plus without any third-party apps"
    },
    {
      "type": "paragraph",
      "content": "If you want to set a custom ringtone in Moto G5 Plus without any third-party apps, then here is a simple method to set a ringtone in Moto G5 Plus. Moto G5 Plus and Moto G5 run on Android 7.1.1. The UI on both devices is identical, so you can also set a custom ringtone in Moto G5 using this method."
    },
    {
      "type": "paragraph",
      "content": "1. First, download or save the ringtone you want to set to your Moto G5 Plus. It is fine if you have the music file on a microSD card."
    },
    {
      "type": "paragraph",
      "content": "2. Now open the file manager."
    },
    {
      "type": "image",
      "src": "../how-to-set-ringtone-in-moto-e4-plus/How-to-set-Ringtone-in-Moto-E4-Plus-7.png",
      "alt": "How to set Ringtone in Moto G5 Plus"
    },
    {
      "type": "paragraph",
      "content": "3. Find the folder where the ringtone is saved (you can also find it under the Audios section)."
    },
    {
      "type": "image",
      "src": "../how-to-set-ringtone-in-moto-e4-plus/How-to-set-Ringtone-in-Moto-E4-Plus-1-1.png",
      "alt": "How to set Ringtone in Moto G5 Plus Step 3"
    },
    {
      "type": "paragraph",
      "content": "4. Copy the file by long pressing the file and then tap on the copy button (overlapping square box button left to three vertical dots) which is at the top."
    },
    {
      "type": "image",
      "src": "../how-to-set-ringtone-in-moto-e4-plus/How-to-set-Ringtone-in-Moto-E4-Plus-2-1.png",
      "alt": "How to set Ringtone in Moto G5 Plus Step 4"
    },
    {
      "type": "paragraph",
      "content": "5. Now go to the folder Local -> Internal storage -> Ringtones."
    },
    {
      "type": "paragraph",
      "content": "6. Paste your ringtone here."
    },
    {
      "type": "image",
      "src": "../how-to-set-ringtone-in-moto-e4-plus/How-to-set-Ringtone-in-Moto-E4-Plus-3-1.png",
      "alt": "How to set Ringtone in Moto G5 Plus Step 6"
    },
    {
      "type": "paragraph",
      "content": "7. Now go to Settings -> Sound -> Phone Ringtone."
    },
    {
      "type": "image",
      "src": "../how-to-set-ringtone-in-moto-e4-plus/How-to-set-Ringtone-in-Moto-E4-Plus-4-1.png",
      "alt": "How to set Ringtone in Moto G5 Plus Step 7"
    },
    {
      "type": "paragraph",
      "content": "8. Choose your ringtone from the list which you want as the default phone ringtone."
    },
    {
      "type": "image",
      "src": "../how-to-set-ringtone-in-moto-e4-plus/How-to-set-Ringtone-in-Moto-E4-Plus-5-1.png",
      "alt": "How to set Ringtone in Moto G5 Plus Step 8"
    },
    {
      "type": "paragraph",
      "content": "9. Click on OK and you're done! The ringtone will be set!"
    },
    {
      "type": "paragraph",
      "content": "Also read: How to set Ringtone in Moto E4 Plus",
      "link": "https://rishitpatel.com/how-to-set-ringtone-in-moto-e4-plus/"
    },
    {
      "type": "heading",
      "content": "How to set Ringtone in Moto G5 Plus using third-party apps"
    },
    {
      "type": "paragraph",
      "content": "If you are having any difficulties in following the above method, then there is another simple method to set a ringtone in Moto G5 Plus. You can set a custom ringtone in Moto G5 Plus using a third-party app called ES File Explorer. You can download it by clicking here. After downloading ES File Explorer, follow the steps mentioned below to set a ringtone in Moto G5 Plus. Again, you can also use this method to set a ringtone in Moto G5 because the UI on both devices is identical."
    },
    {
      "type": "list",
      "items": [
        "Go to Settings -> Sound -> Phone Ringtone.",
        "Select ES File Explorer to open.",
        "Browse to the location where your desired ringtone is saved.",
        "Click on OK and you're done! The ringtone will be set!"
      ]
    },
    {
      "type": "paragraph",
      "content": "Also read: How to take screenshot on Honor 7x",
      "link": "https://rishitpatel.com/how-to-take-screenshot-on-honor-7x/"
    },
    {
      "type": "heading",
      "content": "How to make custom Ringtone and set it as Ringtone in Moto G5 Plus using third-party apps"
    },
    {
      "type": "paragraph",
      "content": "Do you know you can make your own custom ringtones? You can make your own custom ringtone from a song using MP3 Cutter and Ringtone Maker. You can download it by clicking here. After downloading MP3 Cutter and Ringtone Maker, you can make your own ringtone and set it as the default ringtone in Moto G5 Plus by following the step-by-step method shown below. As mentioned before, the UI on Moto G5 Plus and Moto G5 is identical, so you can also use this method for Moto G5 and any other Moto or Android smartphone."
    },
    {
      "type": "list",
      "items": [
        "Download & open MP3 Cutter and Ringtone Maker.",
        "Tap on Cut a Song/Music.",
        "Tap on a song you want to make a ringtone of.",
        "Cut the song according to your preference.",
        "Tap on the save button on top after cutting the song.",
        "Save it as Ringtone type by clicking on 'save'.",
        "Tap on 'MAKE DEFAULT' & you're done! The ringtone will be set!"
      ]
    },
    {
      "type": "paragraph",
      "content": "Share this post with your friends and family if it helped you. If you're facing any issues related to this or anything else on our website, then feel free to contact!"
    }
  ]
}