{
  "title": "How to take screenshot in Moto E4 Plus",
  "date": "2018-03-20T00:00:00.000Z",
  "dateModified": "2020-06-19T00:00:00.000Z",
  "author": "Rishit Patel",
  "description": "Some users face difficulty in taking screenshot in Moto E4 Plus. Here is the easiest step by step guide on how to take screenshot in Moto E4 Plus.",
  "tags": [
    "Smartphones",
    "How to",
    "Tricks"
  ],
  "featureImage": "how-to-take-screenshot-in-moto-e4-plus.png",
  "content": [
    {
      "type": "paragraph",
      "content": "Moto E4 Plus is probably the best smartphone under 10000 rupees in India. One of the main reason that it's the best phone is because it comes with stock Android. Stock Android makes Moto E4 Plus most secured and at the same time least customisable. So, some users face difficulty in taking screenshot and setting custom ringtone in Moto E4 Plus. You can find guide on how to set ringtone in Moto E4 Plus here and step by step guide on how to take screenshot in Moto E4 Plus is given below."
    },
    {
      "type": "heading",
      "content": "How to take a screenshot in Moto E4 Plus using hardware keys"
    },
    {
      "type": "list",
      "items": [
        "Go to the screen on which you want to take the screenshot.",
        "To the right side of your phone, Press and hold the volume down button and power button at the same time for couple of seconds.",
        "The screenshot will be captured.",
        "The captured screenshot will be saved in your photo gallery(You can find it in File Manager) automatically."
      ]
    },
    {
      "type": "image",
      "src": "how-to-take-screenshot-in-moto-e4-plus-img-1.png",
      "alt": "How to take screenshot in Moto E4 Plus",
      "width": 800,
      "height": 663
    },
    {
      "type": "paragraph",
      "content": "I hope this guide helps you to take screenshot in Moto E4 Plus. If you find any difficulty in following this How to take screenshot on Moto E4 Plus guide, Please feel free to share it in the comment section below."
    }
  ]
}