{
  "title": "How to take screenshot on Xiaomi Mi A1",
  "date": "2018-03-17T00:00:00.000Z",
  "dateModified": "2020-06-19T00:00:00.000Z",
  "author": "Rishit Patel",
  "description": "Many users are searching the option for to take screenshot on Xiaomi Mi A1. here are some really simple methods of how to take screenshot on Xiaomi Mi A1.",
  "tags": [
    "Smartphones",
    "How to",
    "Tricks"
  ],
  "featureImage": "how-to-take-screenshot-on-xiaomi-mi-a1.png",
  "content": [
    {
      "type": "paragraph",
      "content": "Xiaomi Mi A1 is one of the best budget Android smartphone of the year 2017. The main attraction of Mi A1 is the stock experience and great camera packed in premium body. But the downside of this is lack of software customization which is available on other Xiaomi smartphones. Due to this, many users are searching the option for How to take screenshot on Xiaomi Mi A1. Like any other smartphone, you can take screenshots on Mi A1 too. So here are some really simple methods of how to take screenshot on Xiaomi Mi A1."
    },
    {
      "type": "heading",
      "level": 2,
      "content": "How to take screenshot on Xiaomi Mi A1 using the hardware keys"
    },
    {
      "type": "paragraph",
      "content": "Taking a screenshot using hardware keys is the most common way of capturing screenshot on any Android smartphone which works on Mi A1 well. Here is the step by step guide on how to take screenshot on Xiaomi Mi A1 using the hardware keys."
    },
    {
      "type": "list",
      "items": [
        "Go to the screen on which you want to take the screenshot.",
        "Press and hold volume down and power button simultaneously for couple of seconds."
      ]
    },
    {
      "type": "image",
      "src": "How-to-take-screenshot-in-Xiaomi-Mi-A1.png",
      "alt": "How to take screenshot on Xiaomi Mi A1",
      "width": 500,
      "height": 500
    },
    {
      "type": "list",
      "items": [
        "The screenshot will be captured.",
        "The screenshot will be automatically saved in Photos->Album->screenshot."
      ]
    },
    {
      "type": "link",
      "href": "/how-to-take-screenshot-on-honor-7x/",
      "content": "Also read: How to take screenshot on Honor 7x"
    },
    {
      "type": "heading",
      "level": 2,
      "content": "How to take screenshot on Xiaomi Mi A1 using menu option"
    },
    {
      "type": "list",
      "items": [
        "Go to the screen on which you want to take the screenshot.",
        "Now drag notification bar from top to bottom and find Toggles.",
        "Next locate the screenshot icon.",
        "Simply tap on the icon to perform screenshot.",
        "The screenshot will be captured.",
        "The screenshot will be automatically saved in Photos->Album->screenshot."
      ]
    },
    {
      "type": "heading",
      "level": 2,
      "content": "How to take screenshot on Xiaomi Mi A1 using the Google Assistant"
    },
    {
      "type": "paragraph",
      "content": "Xiaomi Mi A1 is a Android One device so it comes with Google Assistant. You can take screenshot using the Google Assistant by following steps given below."
    },
    {
      "type": "list",
      "items": [
        "Go to the screen on which you want to take the screenshot and open Google Assistant.",
        "You can do this by saying \"OK Google\" or by long press on home button.",
        "Now either you can say \"Take screenshot\" or type.",
        "Screenshot will be taken.",
        "Do note that, if you are taking screenshot using this method, it will not be saved automatically.",
        "You need to either share or upload it to the Google photos."
      ]
    },
    {
      "type": "paragraph",
      "content": "I hope this guide helps you to take screenshot on Xiaomi Mi A1."
    }
  ]
}